src/xmlsamples/download_1.xml

<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
        <SOAP-ENV:Header>
          <cwmp:ID SOAP-ENV:mustUnderstand="1">API_aa0642e34b23820801e7642ad7cb536c</cwmp:ID>
        </SOAP-ENV:Header>
        <SOAP-ENV:Body>
          <cwmp:Download>
            <CommandKey>cmdkey</CommandKey>
            <FileType>1 Firmware Upgrade Image</FileType>
            <URL>http://example.com/url</URL>
            <Username>user</Username>
            <Password>pass</Password>
            <FileSize>123456</FileSize>
            <TargetFileName>image</TargetFileName>
            <DelaySeconds>5</DelaySeconds>
            <SuccessURL>http://example.com/success</SuccessURL>
            <FailureURL>http://example.com/failure</FailureURL>
          </cwmp:Download>
        </SOAP-ENV:Body>
    </SOAP-ENV:Envelope>